1password
1password-cli
alfred
apifox
arc
asana
claude-code
codex
droid
easydict
figma
font-jetbrains-mono-nerd-font
git-credential-manager
github
google-chrome
hoppscotch
iterm2
orbstack
qq
qspace-pro
rectangle-pro
slack
snipaste
stats
sunloginclient
visual-studio-code
webstorm
wechat
