brew "fish"
brew "git"
brew "go"
brew "gofumpt"
brew "mkcert"
brew "node"
brew "ni"
brew "pnpm"
brew "tree"
brew "yarn"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "arc"
cask "asana"
cask "claude-code"
cask "easydict"
cask "figma"
cask "git-credential-manager"
cask "github"
cask "orbstack"
cask "qspace-pro"
cask "rectangle"
cask "slack"
cask "snipaste"
cask "stats"
cask "visual-studio-code"
cask "webstorm"
cask "wechat"
vscode "amodio.tsl-problem-matcher"
vscode "antfu.iconify"
vscode "antfu.icons-carbon"
vscode "antfu.open-in-github-button"
vscode "antfu.slidev"
vscode "antfu.unocss"
vscode "antfu.where-am-i"
vscode "anthropic.claude-code"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "editorconfig.editorconfig"
vscode "fabiospampinato.vscode-open-in-github"
vscode "file-icons.file-icons"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "lokalise.i18n-ally"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "naumovs.color-highlight"
vscode "richie5um2.vscode-sort-json"
vscode "ritwickdey.liveserver"
vscode "sainnhe.gruvbox-material"
vscode "unional.vscode-sort-package-json"
vscode "usernamehw.errorlens"
vscode "vue.volar"
vscode "zhuangtongfa.material-theme"
go "github.com/makiuchi-d/arelo"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/pressly/goose/v3/cmd/goose"
go "github.com/haya14busa/goplay/cmd/goplay"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "github.com/josharian/impl"
go "honnef.co/go/tools/cmd/staticcheck"
